miblog/app/views/articulos/show.html.erb


<p><%= @articulo.comentarios.count %> Comentarios</p>
---
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = ?  [["articulo_id", 5]]
SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."articulo_id" = ?  [["articulo_id", 5]]