miblog/app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos" ORDER BY created_at DESC
---
  def index
    @articulos = Articulo.all.order("created_at DESC")

INSERT INTO "articulos" ("titulo", "contenido", "autor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "Articulo nuevo"], ["contenido", "Nuevo articulo para probar los estilos"], ["autor_id", 2], ["created_at", "2023-09-26 18:41:14.768242"], ["updated_at", "2023-09-26 18:41:14.768242"]]
---
  def create
    @articulo = current_autor.articulos.build(articulo_params)
    if @articulo.save

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @boton = "Modificar"
    @articulo = Articulo.find(params[:id])

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articulos" SET "titulo" = ?, "contenido" = ?, "updated_at" = ? WHERE "articulos"."id" = ?  [["titulo", "Articulo de prueba"], ["contenido", "Lorem ipsumo dolor sit amet"], ["updated_at", "2023-09-26 12:58:19.002451"], ["id", 5]]
---
  def update
    @articulo = Articulo.find(params[:id])
    if @articulo.update(articulo_params)

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @articulo = Articulo.find(params[:id])

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 6]]
---
  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy

SELECT "articulos".* FROM "articulos" WHERE "articulos"."autor_id" = ? AND "articulos"."id" = ? LIMIT ?  [["autor_id", 3], ["id", 5], ["LIMIT", 1]]
---
  def correct_autor
    @articulo = current_autor.articulos.find_by(id: params[:id])