miblog/app/controllers/comentarios_controller.rb

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comentarios" ("nombre", "texto", "articulo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Manuel"], ["texto", "Que buen articulo!"], ["articulo_id", 5], ["created_at", "2023-09-26 17:03:44.380643"], ["updated_at", "2023-09-26 17:03:44.380643"]]
---
  def create
    @comentario = Comentario.new(comentario_params)

    @articulo = Articulo.find(params[:articulo_id])
    @comentario = @articulo.comentarios.create(comentario_params)

SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @articulo = Articulo.find(params[:articulo_id])
    @comentario = @articulo.comentarios.find(params[:id])